Kevin-Vivas/-Microcontrollers_PIC18F452/PWM/PWM.c
#include <xc.h>
#include <stdio.h>
//....................conf_fusibles................................................................................
#pragma config OSC = XT         // Oscillator Selection bits (XT oscillator)
#pragma config PWRT = ON        // Power-up Timer Enable bit (PWRT enabled)
#pragma config BOR = OFF        // Brown-out Reset Enable bit (Brown-out Reset disabled)
#pragma config WDT = OFF        // Watchdog Timer Enable bit (WDT disabled (control is placed on the SWDTEN bit))
#pragma config LVP = OFF        // Low Voltage ICSP Enable bit (Low Voltage ICSP disabled)

#define _XTAL_FREQ	4000000		// Definici?n del valor del cristal

//..............variables globales y prototipos de funcion.........................................................
unsigned char A=0;

void conf_puertos(void);
void conf_PWM(void);
void duty_1(unsigned char dc);
void duty_2(unsigned char dc);

//..............codigo principal................................................................
void main(void) {
    
    //.........................conf perifericos.................................................
    conf_puertos();
    conf_PWM();
    
    //.........................bucle.............................................................
    while(1)
    {
        duty_1(80);
        duty_2(80);
        __delay_ms(2000);
        duty_1(80);
        duty_2(40);
        __delay_ms(2000);
        duty_1(40);
        duty_2(80);
        __delay_ms(2000);
        duty_1(40);
        duty_2(40);
        __delay_ms(2000);
    }
    
 }

//......................funciones............................................................
void conf_puertos(void){
    
    TRISB=0xFF;         // puerto B de entrada
    LATB=0;             // limpiar puerto B
    PORTB=0;            // limpiar puerto B
    
    TRISD=0x00;         // puerto D de salida
    LATD=0;             // limpia puerto D
    PORTD=0;            // limpia puerto D

    TRISC=0x00;         //Puerto C de salida
    LATC=0;             //Limpiar puertos
    PORTC=0;            //Limpiar puertos
    
}
void conf_PWM(void){
    PR2=124;
    CCPR1L=0;
    CCPR2L=0;
    T2CON=0b00000101;
    CCP1CON=0b00001100;
    CCP2CON=0b00001100;
}
void duty_1(unsigned char dc){
    unsigned int lamda=0;
    
    lamda=dc;
    lamda*=5;
    CCPR1L=lamda>>2;
    lamda<<=4;
    lamda&=0x30;
    CCP1CON&=0xCF;
    CCP1CON|=lamda;
}
void duty_2(unsigned char dc){
    unsigned int lamda=0;
    
    lamda=dc;
    lamda*=5;
    CCPR2L=lamda>>2;
    lamda<<=4;
    lamda&=0x30;
    CCP2CON&=0xCF;
    CCP2CON|=lamda;
}